---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ExportElementIds
source: html/164586b6-5c86-f522-9b62-6999e8c01a16.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ExportElementIds Property

True to export Revit element ids, false to skip these values.
 Default value is true.

## Syntax (C#)
```csharp
public bool ExportElementIds { get; set; }
```